Revit 2024 API
RadialArray Class
 An object that represents an Array created along a circle arc within the Revit project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class RadialArray : BaseArray
Visual Basic
Public Class RadialArray _
	Inherits BaseArray
Visual C++
public ref class RadialArray : public BaseArray
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.BaseArray
 Autodesk.Revit.DB.RadialArray
See Also
RadialArray Members
Autodesk.Revit.DB Namespace